In [2]:
import pandas as pd

In [6]:
data = {"name":["a", "b", "c", "d", "a", "c"], "eng":[8, 7, 5, 8, 8, 5], "hindi":[2, 3, 4, 5, 2, 6]}

In [18]:
df=pd.DataFrame(data)

In [25]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

In [24]:
df.duplicated() #Find duplicate rows

0    False
1    False
2    False
3    False
5    False
dtype: bool

In [23]:
df.drop_duplicates(inplace=True) #Delete duplicate rows

In [26]:
dataset = pd.read_csv("Bank_data.csv")

In [27]:
dataset.head()

,loan_id,married,gender,dependency,Self_Employee,Applicant,coapplicant,Loan_amount,creadit_his,propert,loan_status
0,LN1000,Yes,Female,0,Yes,17154.0,13688.0,133487.0,0.0,Rural,Rejected
1,LN1001,Yes,Male,0,Yes,NaN,2995.0,50849.0,1.0,Urban,Rejected
2,LN1002,Yes,Male,1,No,21923.0,3046.0,85520.0,0.0,Semiurban,Rejected
3,LN1003,NaN,Female,3+,No,19718.0,14947.0,NaN,1.0,Rural,Rejected
4,LN1004,Yes,Female,3+,Yes,9636.0,319.0,299794.0,0.0,Rural,Rejected

In [29]:
dataset.duplicated().sum()

np.int64(0)